БИТУправление_медицинским_центром_демо/src/Documents/ИзменениеСоставаСтрахуемых/ИзменениеСоставаСтрахуемых.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеСоставаСтрахуемых</name>
  <registerRecords>InformationRegister.СоставыСтрахуемых</registerRecords>
  <attributes>
    <name>ВидПолиса</name>
    <type>
      <types>CatalogRef.ВидыПолисов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийИзмененияСоставаСтрахуемых</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Страхуемые</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Полис</name>
      <type>
        <types>CatalogRef.СтраховыеПолисы</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПолиса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПолиса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыОперацийИзмененияСоставаСтрахуемых/ВидыОперацийИзмененияСоставаСтрахуемых.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийИзмененияСоставаСтрахуемых</name>
  <enumValues>
    <name>УтверждениеСписка</name>
  </enumValues>
  <enumValues>
    <name>ДобавлениеВСписок</name>
  </enumValues>
  <enumValues>
    <name>ИсключениеИзСписка</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/СтраховыеПолисы/СтраховыеПолисы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтраховыеПолисы</name>
  <owners>Catalog.Клиенты</owners>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПолиса</name>
    <type>
      <types>CatalogRef.ВидыПолисов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтраховаяКомпания</name>
    <type>
      <types>CatalogRef.умцСтраховыеКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеДействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификаторВидовПолисовРЭМД</name>
    <type>
      <types>CatalogRef.КлассификаторыМинЗдрава</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Documents/ИзменениеСоставаСтрахуемых/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ВидОперации = Перечисления.ВидыОперацийИзмененияСоставаСтрахуемых.ДобавлениеВСписок;
	КонецЕсли;
	УстановитьПодменюВыбораТипаДокумента();
	Заголовок = Объект.ВидОперации;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ДействияФормыДействиеУстановитьОперацию(Команда)
	Если Команда <> Неопределено Тогда
		ДействияФормыДействиеУстановитьОперациюСервер(Команда.Имя);
	КонецЕсли;	
КонецПроцедуры
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура УстановитьПодменюВыбораТипаДокумента()
	
	МассивТипов = Перечисления.ВидыОперацийИзмененияСоставаСтрахуемых.ПустаяСсылка().Метаданные().ЗначенияПеречисления;
	РаботаСДиалогамиСервер.УстановитьПодменюОперации(МассивТипов, ЭтаФорма);
				
КонецПроцедуры

&НаСервере
Процедура ДействияФормыДействиеУстановитьОперациюСервер(КомандаИмя)
	
	Если ЗначениеЗаполнено(КомандаИмя) Тогда // найти новое значение вида операции
		Объект.ВидОперации = Перечисления.ВидыОперацийИзмененияСоставаСтрахуемых[КомандаИмя];
	КонецЕсли;

	Заголовок = Объект.ВидОперации;
КонецПроцедуры

&НаКлиенте
Процедура СтрахуемыеКлиентПриИзменении(Элемент)
	Клиент = Элементы.Страхуемые.ТекущиеДанные.Клиент;
	Если ЗначениеЗаполнено(Объект.ВидПолиса) И ЗначениеЗаполнено(Клиент) Тогда
		СтруктураВозврата = НайтиИЗаполнитьПоТекущемуВидуПолиса(Клиент, Объект.ВидПолиса);
		ЗаполнитьЗначенияСвойств(Элементы.Страхуемые.ТекущиеДанные,СтруктураВозврата);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиИЗаполнитьПоТекущемуВидуПолиса(Клиент, ВидПолиса)
	
	СтруктураВозврата = Новый Структура("Полис,НомерПолиса,СерияПолиса");
	Если Клиент.умцОсновнойСтраховойПолис.ВидПолиса = ВидПолиса Тогда
		
		СтруктураВозврата.Полис = Клиент.умцОсновнойСтраховойПолис;
		СтруктураВозврата.НомерПолиса = Клиент.умцОсновнойСтраховойПолис.Номер;
		СтруктураВозврата.СерияПолиса = Клиент.умцОсновнойСтраховойПолис.Серия;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 2
		               |	СтраховыеПолисы.Ссылка,
		               |	СтраховыеПолисы.Номер,
		               |	СтраховыеПолисы.Серия
		               |ИЗ
		               |	Справочник.СтраховыеПолисы КАК СтраховыеПолисы
		               |ГДЕ
		               |	СтраховыеПолисы.Владелец = &Владелец
		               |	И СтраховыеПолисы.ВидПолиса = &ВидПолиса
		               |	И НЕ СтраховыеПолисы.НеДействителен
		               |	И НЕ СтраховыеПолисы.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Владелец", Клиент);
		Запрос.УстановитьПараметр("ВидПолиса", ВидПолиса);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выгрузить();
		
		Если Выборка.Количество() = 1 Тогда
			
			СтруктураВозврата.Полис = Выборка[0].Ссылка;					
			СтруктураВозврата.НомерПолиса = Выборка[0].Номер;
			СтруктураВозврата.СерияПолиса = Выборка[0].Серия;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
КонецФункции

&НаСервереБезКонтекста
Функция НайтиНомерИСериюПоПолису(Полис)
	
	СтруктураВозврата = Новый Структура("НомерПолиса,СерияПолиса,Клиент");
	
	СтруктураВозврата.СерияПолиса = Полис.Серия;
	СтруктураВозврата.НомерПолиса = Полис.Номер;
	СтруктураВозврата.Клиент	  = Полис.Владелец;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура СтрахуемыеПолисПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Страхуемые.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Полис) Тогда
		СтруктураВозврата = НайтиНомерИСериюПоПолису(ТекущиеДанные.Полис);
		ЗаполнитьЗначенияСвойств(ТекущиеДанные,СтруктураВозврата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрахуемыеПолисНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ВидПолиса) Тогда
		СтандартнаяОбработка = Ложь;
		Предупреждение("Вид полиса не указан", 30);
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Страхуемые.ТекущиеДанные;
	
	Отбор = Новый Массив;
	Отбор.Добавить(Новый ПараметрВыбора("Отбор.ВидПолиса", Объект.ВидПолиса));
	Если ЗначениеЗаполнено(ТекущиеДанные.Клиент) Тогда
		Отбор.Добавить(Новый ПараметрВыбора("Отбор.Владелец", ТекущиеДанные.Клиент));
	КонецЕсли;
	
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(Отбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПолисаПриИзменении(Элемент)
	
	Спросить = Ложь;
	Для каждого Строка из Объект.Страхуемые Цикл
		Если ЗначениеЗаполнено(Строка.Полис) Тогда
			Спросить = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Спросить Тогда
		Если Вопрос("Имеются заполненые полисы, очистить полисы?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Для каждого Строка из Объект.Страхуемые Цикл
					Строка.Полис = ПредопределенноеЗначение("Справочник.СтраховыеПолисы.ПустаяСсылка");
				КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
